MyHome/src/Documents/мх_ПриходЛекарств/мх_ПриходЛекарств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_ПриходЛекарств</name>
  <registerRecords>AccumulationRegister.мх_Лекарства</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.мх_Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.мх_ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Лекарства</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.мх_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.мх_ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/мх_ПриходЛекарств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	мх_ОбработчикиСобытий.ЗаполнитьРеквизитыДокументаПоШаблону(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	мх_ОбработчикиСобытий.ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти(ЭтотОбъект,
																		"Лекарства",
																		"Номенклатура, СрокГодности, Единица",
																		"Количество");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.мх_ПриходЛекарств.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.мх_ПриходЛекарств.ОтразитьДвиженияЛекарства(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
